[
  {
    "id": "cross-daisy",
    "name": "Daisy Method",
    "description": "Use when: You're starting a scrambled cube and white edges are scattered. Look for white edges anywhere on the cube and bring them to surround the yellow center on top (forming a 'daisy'), then flip each one down to the bottom by aligning it with the matching center and doing F2.",
    "algorithm": "F2 D R' D'",
    "setupMoves": "D R D' F2",
    "steps": [
      { "moves": 1, "label": "F2: Flip the white-green edge down from the yellow top to the white bottom — the white sticker lands on the white face and green faces the green center" },
      { "moves": 1, "label": "D: Rotate the white (bottom) layer to move the solved edge out of the way, opening the front slot for the next edge" },
      { "moves": 1, "label": "R': Bring the next white edge (currently on the right side) down toward the bottom layer" },
      { "moves": 1, "label": "D': Rotate the bottom layer back so previously solved cross edges return to their correct positions" }
    ],
    "tier": "beginner",
    "recognition": {
      "topPattern": [0, 1, 0, 1, 0, 1, 0, 1, 0]
    }
  },
  {
    "id": "cross-edge-flip",
    "name": "Edge Flip in Place",
    "description": "Use when: A white edge is in the correct bottom-layer position but the white sticker faces down instead of to the side (or vice versa). The edge is in its slot but flipped wrong. This sequence takes it out, flips it, and puts it back correctly.",
    "algorithm": "F' U L' U'",
    "setupMoves": "U L U' F",
    "steps": [
      { "moves": 1, "label": "F': Pull the white-green edge out of its bottom slot — it goes up to the top layer, but now the white and green stickers have swapped sides" },
      { "moves": 1, "label": "U: Rotate the top layer to move the edge aside, clearing the front column" },
      { "moves": 1, "label": "L': Tuck the edge into the left side — this flips it so the white sticker now faces the correct direction (outward instead of downward)" },
      { "moves": 1, "label": "U': Undo the top rotation — the edge drops back into its original bottom slot, now with white facing the white center and green facing the green center" }
    ],
    "tier": "beginner",
    "recognition": {
      "topPattern": [0, 0, 0, 0, 0, 0, 0, 1, 0]
    }
  },
  {
    "id": "cross-right-layer",
    "name": "Edge from Right Layer",
    "description": "Use when: A white edge is stuck in the middle layer on the right side. You can see the white sticker facing you on the right-side middle slot. This pulls it out and places it on the bottom cross.",
    "algorithm": "R' D' R",
    "setupMoves": "R' D R",
    "steps": [
      { "moves": 1, "label": "R': Swing the right layer down — the white edge stuck in the middle-right slot drops out and moves to the bottom layer" },
      { "moves": 1, "label": "D': Rotate the white (bottom) layer to align this edge underneath its matching colored center" },
      { "moves": 1, "label": "R: Restore the right layer back up — the white edge is now locked into the cross with white facing down and the side color matching its center" }
    ],
    "tier": "beginner",
    "recognition": {
      "topPattern": [0, 0, 0, 0, 0, 1, 0, 0, 0]
    }
  },
  {
    "id": "cross-left-layer",
    "name": "Edge from Left Layer",
    "description": "Use when: A white edge is stuck in the middle layer on the left side. Mirror of the right-layer case. Pulls the edge out and places it on the bottom cross.",
    "algorithm": "L D L'",
    "setupMoves": "L D' L'",
    "steps": [
      { "moves": 1, "label": "L: Swing the left layer down — the white edge stuck in the middle-left slot drops out and moves to the bottom layer" },
      { "moves": 1, "label": "D: Rotate the white (bottom) layer to align this edge underneath its matching colored center" },
      { "moves": 1, "label": "L': Restore the left layer back up — the white edge is now locked into the cross with white facing down and the side color matching its center" }
    ],
    "tier": "beginner",
    "recognition": {
      "topPattern": [0, 0, 0, 1, 0, 0, 0, 0, 0]
    }
  }
]
