[
  {
    "id": "f2l-basic-insert",
    "name": "Basic Insert (Right)",
    "description": "Use when: The white corner and its matching edge are both in the top layer and already next to each other (paired). The white sticker on the corner faces to the right. Simply insert the pair into the front-right slot with this 4-move sequence.",
    "algorithm": "U R U' R'",
    "setupMoves": "R U R' U'",
    "steps": [
      { "moves": 1, "label": "U: Rotate the top layer to position the white-red-green corner and its matching edge directly above the front-right slot" },
      { "moves": 1, "label": "R: Lift the right layer — this opens the front-right slot, creating a gap for the corner-edge pair to slide into" },
      { "moves": 1, "label": "U': Rotate the top layer back — the paired corner and edge now drop into the opened slot" },
      { "moves": 1, "label": "R': Lower the right layer back — the slot closes, locking the white corner (white facing down) and the matching edge into the first layer" }
    ],
    "tier": "beginner",
    "recognition": {
      "topPattern": [0, 0, 1, 0, 0, 0, 0, 0, 0]
    }
  },
  {
    "id": "f2l-basic-insert-left",
    "name": "Basic Insert (Left)",
    "description": "Use when: The corner and edge are paired in the top layer, but the white sticker on the corner faces left. Mirror of the right insert -- inserts the pair into the front-left slot.",
    "algorithm": "U' L' U L",
    "setupMoves": "L' U' L U",
    "steps": [
      { "moves": 1, "label": "U': Rotate the top layer to position the white-orange-green corner and its matching edge directly above the front-left slot" },
      { "moves": 1, "label": "L': Lift the left layer — this opens the front-left slot, creating a gap for the pair" },
      { "moves": 1, "label": "U: Rotate the top layer back — the paired corner and edge drop into the opened slot" },
      { "moves": 1, "label": "L: Lower the left layer back — the slot closes, locking the white corner and matching edge into the first layer" }
    ],
    "tier": "beginner",
    "recognition": {
      "topPattern": [1, 0, 0, 0, 0, 0, 0, 0, 0]
    }
  },
  {
    "id": "f2l-split-pair",
    "name": "Split and Pair (Right)",
    "description": "Use when: The white corner and edge are both in the top layer but NOT paired -- they're separated. This algorithm moves them apart, then brings them back together in the right orientation before inserting. Watch for when the corner's white sticker faces upward and the edge is on the opposite side.",
    "algorithm": "U' R U R' U R U' R'",
    "setupMoves": "R U R' U' R U' R' U",
    "steps": [
      { "moves": 2, "label": "U' R: Move the white corner away from the edge and lift the right layer — this separates the two pieces so they can be re-paired in the correct orientation" },
      { "moves": 2, "label": "U R': Rotate the top to bring the edge next to the corner, then lower the right layer — the white corner and its matching colored edge are now paired with white facing the right side" },
      { "moves": 2, "label": "U R: Rotate the top to position the paired pieces directly above the front-right slot, then lift to open the slot" },
      { "moves": 2, "label": "U' R': Drop the pair into the slot and close — the white corner sits in the bottom with white facing down, and the edge colors match the front and right centers" }
    ],
    "tier": "beginner",
    "recognition": {
      "topPattern": [0, 0, 1, 0, 0, 0, 0, 0, 0]
    }
  },
  {
    "id": "f2l-corner-in-slot",
    "name": "Corner in Slot, Edge in Top",
    "description": "Use when: The white corner is already sitting in its correct slot in the bottom layer (possibly twisted so white faces sideways), but the matching edge is still in the top layer. First pull the corner out (R U R'), then pair it with the edge and reinsert. This is longer but common in real solves.",
    "algorithm": "R U R' U' R U R' U' R U R'",
    "setupMoves": "R U' R' U R U' R' U R U' R'",
    "steps": [
      { "moves": 3, "label": "R U R': Pull the white corner out of its bottom-layer slot — it lifts to the top layer. The corner has white on it but it was twisted wrong in the slot (white facing sideways, not down)" },
      { "moves": 4, "label": "U' R U R' U': Rotate the top layer to bring the matching colored edge next to the extracted corner, then re-pair them — the white sticker on the corner now faces the correct direction" },
      { "moves": 4, "label": "R U R': Insert the now-paired corner and edge back into the front-right slot — white faces down on the bottom layer, and both side colors match their centers" }
    ],
    "tier": "beginner",
    "recognition": {
      "topPattern": [0, 0, 0, 0, 0, 0, 0, 0, 1]
    }
  },
  {
    "id": "f2l-edge-in-slot",
    "name": "Edge in Slot, Corner in Top",
    "description": "Use when: The edge is already in the correct slot in the middle layer, but the matching white corner is in the top layer. You need to take the edge out without disturbing other solved pairs, pair it with the corner, and reinsert both together.",
    "algorithm": "U R U' R' U' F' U F",
    "setupMoves": "F' U' F U R U R' U'",
    "steps": [
      { "moves": 4, "label": "U R U' R': Use the white corner from the top layer to push the matching edge out of its middle-layer slot — the corner moves down while the edge pops up to the top layer" },
      { "moves": 4, "label": "U' F' U F: Rotate the top to align the edge with the corner, then insert both together through the front — the white corner lands with white facing down, and the edge colors match the front and right centers" }
    ],
    "tier": "beginner",
    "recognition": {
      "topPattern": [0, 0, 1, 0, 0, 0, 0, 0, 0]
    }
  }
]
